Revit 2027 API
Material.CutBackgroundPatternColor Property
 The color of the material cut background pattern.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Color CutBackgroundPatternColor { get; set; }
Public Property CutBackgroundPatternColor As Color
	Get
	Set
public:
property Color^ CutBackgroundPatternColor {
	Color^ get ();
	void set (Color^ value);
}
member CutBackgroundPatternColor : Color with get, set
Property Value
Color
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
Material Class
Autodesk.Revit.DB Namespace